<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Greyscalegorilla Studio</string>
    <key>Identifier</key>
    <string>com.github.martink-bsco.download.greyscalegorillastudio</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Greyscalegorilla-Studio</string>
        		<key>USER_AGENT</key>
		<string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_14_6) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/12.1.2 Safari/605.1.15</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.2.12</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>(https:\/\/greyscalegorilla\.com\/large-download\/\?path=Studio\/Greyscalegorilla\.Studio_\d*\.\d*\.\d*_universal.dmg)</string>
                <key>request_headers</key>
				<dict>
					<key>user-agent</key>
					<string>%USER_AGENT%</string>
				</dict>
                <key>result_output_var_name</key>
                <string>url</string>
                <key>url</key>
                <string>https://greyscalegorilla.com/studio-download/</string>
            </dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
